garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q24.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTWDF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PORTWDF" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x10B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DF0" edc:desc="" edc:mask="0x1" edc:name="DF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DF1" edc:desc="" edc:mask="0x1" edc:name="DF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DF2" edc:desc="" edc:mask="0x1" edc:name="DF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF3" edc:desc="" edc:mask="0x1" edc:name="DF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF4" edc:desc="" edc:mask="0x1" edc:name="DF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF5" edc:desc="" edc:mask="0x1" edc:name="DF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF6" edc:desc="" edc:mask="0x1" edc:name="DF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF7" edc:desc="" edc:mask="0x1" edc:name="DF7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWDF0" edc:desc="" edc:mask="0x1" edc:name="PWDF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWDF1" edc:desc="" edc:mask="0x1" edc:name="PWDF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWDF2" edc:mask="0x1" edc:name="PWDF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWDF3" edc:desc="" edc:mask="0x1" edc:name="PWDF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWDF4" edc:mask="0x1" edc:name="PWDF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWDF5" edc:mask="0x1" edc:name="PWDF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWDF6" edc:mask="0x1" edc:name="PWDF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWDF7" edc:mask="0x1" edc:name="PWDF7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DF" edc:mask="0xff" edc:name="DF" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="PWDF" edc:mask="0xff" edc:name="PWDF" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------n" edc:cname="PORTWCON" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PORTWCON" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x10C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLKEN" edc:desc="" edc:mask="0x1" edc:name="CLKEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nrrnnnnn" edc:cname="VDDIO2CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="VDDIO2CON" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x10D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEL" edc:mask="0xf" edc:name="SEL" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="NOT_HYS" edc:mask="0x1" edc:name="NOT_HYS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RDY" edc:mask="0x1" edc:name="RDY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LVDSTAT" edc:mask="0x1" edc:name="LVDSTAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOT_IOMON" edc:mask="0x1" edc:name="NOT_IOMON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SEL0" edc:mask="0x1" edc:name="SEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEL1" edc:mask="0x1" edc:name="SEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEL2" edc:mask="0x1" edc:name="SEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEL3" edc:mask="0x1" edc:name="SEL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nHYS" edc:mask="0x1" edc:name="nHYS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nIOMON" edc:mask="0x1" edc:name="nIOMON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x10E"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADCG1A" edc:desc="ADC CHANNEL GROUP A REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADCG1A" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="1" edc:_begin="0x22" edc:_end="0x28" edc:_addr="0x110">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CGA0" edc:mask="0x1" edc:name="CGA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA1" edc:mask="0x1" edc:name="CGA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA2" edc:mask="0x1" edc:name="CGA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA3" edc:mask="0x1" edc:name="CGA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA4" edc:mask="0x1" edc:name="CGA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA5" edc:mask="0x1" edc:name="CGA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA6" edc:mask="0x1" edc:name="CGA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA7" edc:mask="0x1" edc:name="CGA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADCG1B" edc:desc="ADC CHANNEL GROUP B REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADCG1B" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="1" edc:_begin="0x22" edc:_end="0x28" edc:_addr="0x111">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CGB0" edc:mask="0x1" edc:name="CGB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB1" edc:mask="0x1" edc:name="CGB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB2" edc:mask="0x1" edc:name="CGB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB3" edc:mask="0x1" edc:name="CGB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB4" edc:mask="0x1" edc:name="CGB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB5" edc:mask="0x1" edc:name="CGB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB6" edc:mask="0x1" edc:name="CGB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB7" edc:mask="0x1" edc:name="CGB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="ADCG1C" edc:desc="ADC CHANNEL GROUP C REGISTER" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="ADCG1C" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="1" edc:_begin="0x22" edc:_end="0x28" edc:_addr="0x112">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CGC0" edc:mask="0x1" edc:name="CGC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC1" edc:mask="0x1" edc:name="CGC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC2" edc:mask="0x1" edc:name="CGC2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x113"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="ADCG1E" edc:desc="ADC CHANNEL GROUP C REGISTER" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="ADCG1E" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="1" edc:_begin="0x22" edc:_end="0x28" edc:_addr="0x114">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CGE0" edc:mask="0x1" edc:name="CGE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGE1" edc:mask="0x1" edc:name="CGE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGE2" edc:mask="0x1" edc:name="CGE2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x115"/>
        <edc:AdjustPoint edc:offset="0x2A" edc:_addr="0x116"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATA" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x140">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATA0" edc:desc="" edc:mask="0x1" edc:name="LATA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA1" edc:desc="" edc:mask="0x1" edc:name="LATA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA2" edc:desc="" edc:mask="0x1" edc:name="LATA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA3" edc:desc="" edc:mask="0x1" edc:name="LATA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA4" edc:desc="" edc:mask="0x1" edc:name="LATA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA5" edc:desc="" edc:mask="0x1" edc:name="LATA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA6" edc:desc="" edc:mask="0x1" edc:name="LATA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA7" edc:desc="" edc:mask="0x1" edc:name="LATA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATB" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x141">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATB0" edc:desc="" edc:mask="0x1" edc:name="LATB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB1" edc:desc="" edc:mask="0x1" edc:name="LATB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB2" edc:desc="" edc:mask="0x1" edc:name="LATB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB3" edc:desc="" edc:mask="0x1" edc:name="LATB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB4" edc:desc="" edc:mask="0x1" edc:name="LATB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB5" edc:desc="" edc:mask="0x1" edc:name="LATB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB6" edc:desc="" edc:mask="0x1" edc:name="LATB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB7" edc:desc="" edc:mask="0x1" edc:name="LATB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="LATC" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="LATC" edc:nzwidth="0x8" edc:por="-xxxxxxx" edc:_addr="0x142">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATC0" edc:desc="" edc:mask="0x1" edc:name="LATC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC1" edc:desc="" edc:mask="0x1" edc:name="LATC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC2" edc:desc="" edc:mask="0x1" edc:name="LATC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC3" edc:desc="" edc:mask="0x1" edc:name="LATC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC4" edc:desc="" edc:mask="0x1" edc:name="LATC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC5" edc:desc="" edc:mask="0x1" edc:name="LATC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC6" edc:desc="" edc:mask="0x1" edc:name="LATC6" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATD" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x143">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATD0" edc:desc="" edc:mask="0x1" edc:name="LATD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD1" edc:desc="" edc:mask="0x1" edc:name="LATD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD2" edc:desc="" edc:mask="0x1" edc:name="LATD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD3" edc:desc="" edc:mask="0x1" edc:name="LATD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD4" edc:desc="" edc:mask="0x1" edc:name="LATD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD5" edc:desc="" edc:mask="0x1" edc:name="LATD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD6" edc:desc="" edc:mask="0x1" edc:name="LATD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD7" edc:desc="" edc:mask="0x1" edc:name="LATD7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
