garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q24.PIC
        <edc:SFRDef edc:access="rrrrr---" edc:cname="I2C2STAT0" edc:desc="I2C STATUS REGISTER 0" edc:impl="0xe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I2C2STAT0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2AE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="D" edc:desc="Data/Address bit" edc:mask="0x1" edc:name="D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R" edc:desc="Read/Write Information bit" edc:mask="0x1" edc:name="R" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MMA" edc:mask="0x1" edc:name="MMA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMA" edc:mask="0x1" edc:name="SMA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BFRE" edc:mask="0x1" edc:name="BFRE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="DATA" edc:mask="0x1" edc:name="DATA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="READ" edc:mask="0x1" edc:name="READ" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NOT_ADDRESS" edc:mask="0x1" edc:name="NOT_ADDRESS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOT_WRITE" edc:mask="0x1" edc:name="NOT_WRITE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NOT_A" edc:mask="0x1" edc:name="NOT_A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOT_W" edc:mask="0x1" edc:name="NOT_W" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-r-ns-r" edc:cname="I2C2STAT1" edc:desc="I2C STATUS REGISTER 1" edc:impl="0xad" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00100000" edc:name="I2C2STAT1" edc:nzwidth="8" edc:por="00100000" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2AF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXBF" edc:mask="0x1" edc:name="RXBF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CLRBF" edc:mask="0x1" edc:name="CLRBF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRE" edc:mask="0x1" edc:name="RXRE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBE" edc:mask="0x1" edc:name="TXBE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXWE" edc:mask="0x1" edc:name="TXWE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="I2C2PIR" edc:desc="I2C PERIPHERAL INTERRUPT FLAG REGISTER" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I2C2PIR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2B0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCIF" edc:mask="0x1" edc:name="SCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSCIF" edc:mask="0x1" edc:name="RSCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCIF" edc:mask="0x1" edc:name="PCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADRIF" edc:mask="0x1" edc:name="ADRIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WRIF" edc:mask="0x1" edc:name="WRIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKTIF" edc:mask="0x1" edc:name="ACKTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNTIF" edc:mask="0x1" edc:name="CNTIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SC2IF" edc:mask="0x1" edc:name="SC2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSC2IF" edc:mask="0x1" edc:name="RSC2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PC2IF" edc:mask="0x1" edc:name="PC2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADR2IF" edc:mask="0x1" edc:name="ADR2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WR2IF" edc:mask="0x1" edc:name="WR2IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKT2IF" edc:mask="0x1" edc:name="ACKT2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT2IF" edc:mask="0x1" edc:name="CNT2IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="I2C2PIE" edc:desc="I2C PERIPHERAL INTERRUPT ENABLE REGISTER" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I2C2PIE" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2B1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCIE" edc:mask="0x1" edc:name="SCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSCIE" edc:mask="0x1" edc:name="RSCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCIE" edc:mask="0x1" edc:name="PCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADRIE" edc:mask="0x1" edc:name="ADRIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WRIE" edc:mask="0x1" edc:name="WRIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKTIE" edc:mask="0x1" edc:name="ACKTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNTIE" edc:mask="0x1" edc:name="CNTIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SC2IE" edc:mask="0x1" edc:name="SC2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSC2IE" edc:mask="0x1" edc:name="RSC2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PC2IE" edc:mask="0x1" edc:name="PC2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADR2IE" edc:mask="0x1" edc:name="ADR2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WR2IE" edc:mask="0x1" edc:name="WR2IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKT2IE" edc:mask="0x1" edc:name="ACKT2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT2IE" edc:mask="0x1" edc:name="CNT2IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
