garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q24.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C2BTO" edc:desc="I2C BUS TIME OUT SELECTION REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C2BTO" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2B2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOTIME" edc:mask="0x3f" edc:name="TOTIME" edc:nzwidth="0x6"/>
              <edc:SFRFieldDef edc:cname="TOBY32" edc:mask="0x1" edc:name="TOBY32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOREC" edc:mask="0x1" edc:name="TOREC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TOTIME0" edc:mask="0x1" edc:name="TOTIME0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOTIME1" edc:mask="0x1" edc:name="TOTIME1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOTIME2" edc:mask="0x1" edc:name="TOTIME2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOTIME3" edc:mask="0x1" edc:name="TOTIME3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOTIME4" edc:mask="0x1" edc:name="TOTIME4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOTIME5" edc:mask="0x1" edc:name="TOTIME5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C2BAUD" edc:desc="I2C BAUD RATE PRESCALER REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C2BAUD" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2B3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BAUD" edc:mask="0xff" edc:name="BAUD" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="I2C2CLK" edc:desc="I2C CLOCK SELECTION REGISTER" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="I2C2CLK" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2B4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:mask="0x1f" edc:name="CLK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="I2CCLK" edc:mask="0x1f" edc:name="I2CCLK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK2" edc:mask="0x1" edc:name="CLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK3" edc:mask="0x1" edc:name="CLK3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK4" edc:mask="0x1" edc:name="CLK4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CCLK0" edc:mask="0x1" edc:name="I2CCLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CCLK1" edc:mask="0x1" edc:name="I2CCLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CCLK2" edc:mask="0x1" edc:name="I2CCLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CCLK3" edc:mask="0x1" edc:name="I2CCLK3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CCLK4" edc:mask="0x1" edc:name="I2CCLK4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="I2C2BTOC" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="I2C2BTOC" edc:nzwidth="8" edc:por="----xxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2B5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BTOC" edc:mask="0xf" edc:name="BTOC" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="I2CBTOC" edc:mask="0xf" edc:name="I2CBTOC" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="BTOC0" edc:mask="0x1" edc:name="BTOC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTOC1" edc:mask="0x1" edc:name="BTOC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTOC2" edc:mask="0x1" edc:name="BTOC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTOC3" edc:mask="0x1" edc:name="BTOC3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CBTOC0" edc:mask="0x1" edc:name="I2CBTOC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CBTOC1" edc:mask="0x1" edc:name="I2CBTOC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CBTOC2" edc:mask="0x1" edc:name="I2CBTOC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CBTOC3" edc:mask="0x1" edc:name="I2CBTOC3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="U1RXB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U1RXB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2B6">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="U1RXBL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB" edc:desc="" edc:mask="0xff" edc:name="RXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U1RXCHK" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U1RXCHK" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2B7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXCHK" edc:desc="" edc:mask="0xff" edc:name="RXCHK" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U1TXB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U1TXB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2B8">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="U1TXBL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB" edc:desc="" edc:mask="0xff" edc:name="TXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U1TXCHK" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U1TXCHK" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2B9">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXCHK" edc:desc="" edc:mask="0xff" edc:name="TXCHK" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="U1P1" edc:desc="" edc:name="U1P1" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2BA">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U1P1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U1P1L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2BA">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P1L" edc:desc="" edc:mask="0xff" edc:name="P1L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="-------n" edc:cname="U1P1H" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="U1P1H" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2BB">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P1H" edc:desc="" edc:mask="0x1" edc:name="P1H" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
