garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q24.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SCANHADRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SCANHADRH" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x35E">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="HADR" edc:mask="0xff" edc:name="HADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="HADR8" edc:mask="0x1" edc:name="HADR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR9" edc:mask="0x1" edc:name="HADR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR10" edc:mask="0x1" edc:name="HADR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR11" edc:mask="0x1" edc:name="HADR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR12" edc:mask="0x1" edc:name="HADR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR13" edc:mask="0x1" edc:name="HADR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR14" edc:mask="0x1" edc:name="HADR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR15" edc:mask="0x1" edc:name="HADR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANHADR" edc:mask="0xff" edc:name="SCANHADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANHADR8" edc:mask="0x1" edc:name="SCANHADR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR9" edc:mask="0x1" edc:name="SCANHADR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR10" edc:mask="0x1" edc:name="SCANHADR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR11" edc:mask="0x1" edc:name="SCANHADR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR12" edc:mask="0x1" edc:name="SCANHADR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR13" edc:mask="0x1" edc:name="SCANHADR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR14" edc:mask="0x1" edc:name="SCANHADR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR15" edc:mask="0x1" edc:name="SCANHADR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="SCANHADRU" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111" edc:name="SCANHADRU" edc:nzwidth="8" edc:por="--111111" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x35F">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="HADR" edc:mask="0x3f" edc:name="HADR" edc:nzwidth="0x6"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="HADR16" edc:mask="0x1" edc:name="HADR16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR17" edc:mask="0x1" edc:name="HADR17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR18" edc:mask="0x1" edc:name="HADR18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR19" edc:mask="0x1" edc:name="HADR19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR20" edc:mask="0x1" edc:name="HADR20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR21" edc:mask="0x1" edc:name="HADR21" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANHADR" edc:mask="0x3f" edc:name="SCANHADR" edc:nzwidth="0x6"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANHADR16" edc:mask="0x1" edc:name="SCANHADR16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR17" edc:mask="0x1" edc:name="SCANHADR17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR18" edc:mask="0x1" edc:name="SCANHADR18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR19" edc:mask="0x1" edc:name="SCANHADR19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR20" edc:mask="0x1" edc:name="SCANHADR20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR21" edc:mask="0x1" edc:name="SCANHADR21" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnn--nnn" edc:cname="SCANCON0" edc:desc="" edc:impl="0xe7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000--100" edc:name="SCANCON0" edc:nzwidth="8" edc:por="000--100" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x360">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BUSY" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BURSTMD" edc:mask="0x1" edc:name="BURSTMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MREG" edc:mask="0x1" edc:name="MREG" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="SGO" edc:desc="" edc:mask="0x1" edc:name="SGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRIGEN" edc:desc="" edc:mask="0x1" edc:name="TRIGEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x7"/>
              <edc:SFRFieldDef edc:cname="SCANEN" edc:mask="0x1" edc:name="SCANEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SCANTRIG" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="SCANTRIG" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x361">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSEL" edc:desc="" edc:mask="0x1f" edc:name="TSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TSEL0" edc:desc="" edc:mask="0x1" edc:name="TSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSEL1" edc:desc="" edc:mask="0x1" edc:name="TSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSEL2" edc:desc="" edc:mask="0x1" edc:name="TSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSEL3" edc:desc="" edc:mask="0x1" edc:name="TSEL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSEL4" edc:desc="" edc:mask="0x1" edc:name="TSEL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SCANTSEL" edc:desc="" edc:mask="0x1f" edc:name="SCANTSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x11" edc:_addr="0x362"/>
        <edc:SFRDef edc:access="-rrnnnnn" edc:cname="STATUS_CSHAD" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="false" edc:mclr="-qquuuuu" edc:name="STATUS_CSHAD" edc:nzwidth="0x8" edc:por="-1100000" edc:_addr="0x373">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C" edc:desc="" edc:mask="0x1" edc:name="C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x1" edc:name="DC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Z" edc:desc="" edc:mask="0x1" edc:name="Z" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OV" edc:desc="" edc:mask="0x1" edc:name="OV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="N" edc:desc="" edc:mask="0x1" edc:name="N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nPD" edc:mask="0x1" edc:name="nPD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nTO" edc:mask="0x1" edc:name="nTO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="PD" edc:mask="0x1" edc:name="PD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TO" edc:mask="0x1" edc:name="TO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WREG_CSHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuu" edc:name="WREG_CSHAD" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x374">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG" edc:desc="" edc:mask="0xff" edc:name="WREG" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="BSR_CSHAD" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--000000" edc:name="BSR_CSHAD" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0x375">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BSR" edc:desc="" edc:islanghidden="true" edc:mask="0x3f" edc:name="BSR" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------n" edc:cname="SHADCON" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="SHADCON" edc:nzwidth="8" edc:por="-------0" edc:_addr="0x376">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SHADLO" edc:mask="0x1" edc:name="SHADLO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrnnnnn" edc:cname="STATUS_SHAD" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="false" edc:mclr="-qquuuuu" edc:name="STATUS_SHAD" edc:nzwidth="0x8" edc:por="-1100000" edc:_addr="0x377">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C" edc:desc="" edc:mask="0x1" edc:name="C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x1" edc:name="DC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Z" edc:desc="" edc:mask="0x1" edc:name="Z" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OV" edc:desc="" edc:mask="0x1" edc:name="OV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="N" edc:desc="" edc:mask="0x1" edc:name="N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nPD" edc:mask="0x1" edc:name="nPD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nTO" edc:mask="0x1" edc:name="nTO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="PD" edc:mask="0x1" edc:name="PD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TO" edc:mask="0x1" edc:name="TO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WREG_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuu" edc:name="WREG_SHAD" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x378">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG" edc:desc="" edc:mask="0xff" edc:name="WREG" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="BSR_SHAD" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--000000" edc:name="BSR_SHAD" edc:nzwidth="0x8" edc:por="--000000" edc:_addr="0x379">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BSR" edc:desc="" edc:islanghidden="true" edc:mask="0x3f" edc:name="BSR" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PCLATH_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PCLATH_SHAD" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x37A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:mask="0xff" edc:name="PCH" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PCLATU_SHAD" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="PCLATU_SHAD" edc:nzwidth="0x8" edc:por="---00000" edc:_addr="0x37B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCU" edc:mask="0x1f" edc:name="PCU" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
