garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q24.PIC
        <edc:SFRDef edc:access="rnnnnnnn" edc:cname="TU16ACON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16ACON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x39E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CIF" edc:desc="" edc:mask="0x1" edc:name="CIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ZIF" edc:desc="" edc:mask="0x1" edc:name="ZIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PRIF" edc:desc="" edc:mask="0x1" edc:name="PRIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CAPT" edc:desc="" edc:mask="0x1" edc:name="CAPT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LIMIT" edc:mask="0x1" edc:name="LIMIT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLR" edc:desc="" edc:mask="0x1" edc:name="CLR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSEN" edc:desc="" edc:mask="0x1" edc:name="OSEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RUN" edc:desc="" edc:mask="0x1" edc:name="RUN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TU16ACIF" edc:mask="0x1" edc:name="TU16ACIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AZIF" edc:mask="0x1" edc:name="TU16AZIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16APRIF" edc:mask="0x1" edc:name="TU16APRIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ACAPT" edc:mask="0x1" edc:name="TU16ACAPT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ALIMIT" edc:mask="0x1" edc:name="TU16ALIMIT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ACLR" edc:desc="" edc:mask="0x1" edc:name="TU16ACLR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMRAOSEN" edc:desc="" edc:mask="0x1" edc:name="TMRAOSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TU16ARUN" edc:desc="" edc:mask="0x1" edc:name="TU16ARUN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16AHLT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16AHLT" edc:nzwidth="8" edc:por="01000000" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x39F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STOP" edc:mask="0x3" edc:name="STOP" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="RESET" edc:mask="0x3" edc:name="RESET" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="START" edc:mask="0x3" edc:name="START" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="CSYNC" edc:mask="0x1" edc:name="CSYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPOL" edc:mask="0x1" edc:name="EPOL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="STOP0" edc:mask="0x1" edc:name="STOP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STOP1" edc:mask="0x1" edc:name="STOP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESET0" edc:mask="0x1" edc:name="RESET0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESET1" edc:mask="0x1" edc:name="RESET1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="START0" edc:mask="0x1" edc:name="START0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="START1" edc:mask="0x1" edc:name="START1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TU16ASTOP" edc:mask="0x3" edc:name="TU16ASTOP" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TU16ARESET" edc:mask="0x3" edc:name="TU16ARESET" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TU16ASTART" edc:mask="0x3" edc:name="TU16ASTART" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TU16ACSYNC" edc:mask="0x1" edc:name="TU16ACSYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AEPOL" edc:mask="0x1" edc:name="TU16AEPOL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="TU16ASTOP0" edc:mask="0x1" edc:name="TU16ASTOP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ASTOP1" edc:mask="0x1" edc:name="TU16ASTOP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ARESET0" edc:mask="0x1" edc:name="TU16ARESET0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ARESET1" edc:mask="0x1" edc:name="TU16ARESET1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ASTART0" edc:mask="0x1" edc:name="TU16ASTART0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16ASTART1" edc:mask="0x1" edc:name="TU16ASTART1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16APS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16APS" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x3A0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PS" edc:mask="0xff" edc:name="PS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PS0" edc:mask="0x1" edc:name="PS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS1" edc:mask="0x1" edc:name="PS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS2" edc:mask="0x1" edc:name="PS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS3" edc:mask="0x1" edc:name="PS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS4" edc:mask="0x1" edc:name="PS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS5" edc:mask="0x1" edc:name="PS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS6" edc:mask="0x1" edc:name="PS6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS7" edc:mask="0x1" edc:name="PS7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TU16APS0" edc:mask="0x1" edc:name="TU16APS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16APS1" edc:mask="0x1" edc:name="TU16APS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16APS2" edc:mask="0x1" edc:name="TU16APS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16APS3" edc:mask="0x1" edc:name="TU16APS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16APS4" edc:mask="0x1" edc:name="TU16APS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16APS5" edc:mask="0x1" edc:name="TU16APS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16APS6" edc:mask="0x1" edc:name="TU16APS6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16APS7" edc:mask="0x1" edc:name="TU16APS7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="TU16APS" edc:mask="0xff" edc:name="TU16APS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
