garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q24.PIC
        <edc:JoinedSFRDef edc:cname="TU16BPR" edc:desc="" edc:name="TU16BPR" edc:nzwidth="0x10" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x3B3">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BPRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BPRL" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x3B3">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRL" edc:mask="0xff" edc:name="PRL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PRL0" edc:mask="0x1" edc:name="PRL0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL1" edc:mask="0x1" edc:name="PRL1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL2" edc:mask="0x1" edc:name="PRL2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL3" edc:mask="0x1" edc:name="PRL3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL4" edc:mask="0x1" edc:name="PRL4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL5" edc:mask="0x1" edc:name="PRL5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL6" edc:mask="0x1" edc:name="PRL6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL7" edc:mask="0x1" edc:name="PRL7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="TU16BPRL0" edc:mask="0x1" edc:name="TU16BPRL0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL1" edc:mask="0x1" edc:name="TU16BPRL1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL2" edc:mask="0x1" edc:name="TU16BPRL2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL3" edc:mask="0x1" edc:name="TU16BPRL3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL4" edc:mask="0x1" edc:name="TU16BPRL4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL5" edc:mask="0x1" edc:name="TU16BPRL5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL6" edc:mask="0x1" edc:name="TU16BPRL6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL7" edc:mask="0x1" edc:name="TU16BPRL7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="TU16BPR0" edc:mask="0x1" edc:name="TU16BPR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR1" edc:mask="0x1" edc:name="TU16BPR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR2" edc:mask="0x1" edc:name="TU16BPR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR3" edc:mask="0x1" edc:name="TU16BPR3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR4" edc:mask="0x1" edc:name="TU16BPR4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR5" edc:mask="0x1" edc:name="TU16BPR5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR6" edc:mask="0x1" edc:name="TU16BPR6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR7" edc:mask="0x1" edc:name="TU16BPR7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BPRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BPRH" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x3B4">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRH" edc:mask="0xff" edc:name="PRH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PRH0" edc:mask="0x1" edc:name="PRH0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH1" edc:mask="0x1" edc:name="PRH1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH2" edc:mask="0x1" edc:name="PRH2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH3" edc:mask="0x1" edc:name="PRH3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH4" edc:mask="0x1" edc:name="PRH4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH5" edc:mask="0x1" edc:name="PRH5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH6" edc:mask="0x1" edc:name="PRH6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH7" edc:mask="0x1" edc:name="PRH7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="TU16BPRH0" edc:mask="0x1" edc:name="TU16BPRH0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH1" edc:mask="0x1" edc:name="TU16BPRH1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH2" edc:mask="0x1" edc:name="TU16BPRH2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH3" edc:mask="0x1" edc:name="TU16BPRH3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH4" edc:mask="0x1" edc:name="TU16BPRH4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH5" edc:mask="0x1" edc:name="TU16BPRH5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH6" edc:mask="0x1" edc:name="TU16BPRH6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH7" edc:mask="0x1" edc:name="TU16BPRH7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="TU16BPR8" edc:mask="0x1" edc:name="TU16BPR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR9" edc:mask="0x1" edc:name="TU16BPR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR10" edc:mask="0x1" edc:name="TU16BPR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR11" edc:mask="0x1" edc:name="TU16BPR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR12" edc:mask="0x1" edc:name="TU16BPR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR13" edc:mask="0x1" edc:name="TU16BPR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR14" edc:mask="0x1" edc:name="TU16BPR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR15" edc:mask="0x1" edc:name="TU16BPR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0x3B5"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BPRT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BPRT" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x3B6">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRT" edc:mask="0xff" edc:name="PRT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PRT0" edc:mask="0x1" edc:name="PRT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT1" edc:mask="0x1" edc:name="PRT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT2" edc:mask="0x1" edc:name="PRT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT3" edc:mask="0x1" edc:name="PRT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT4" edc:mask="0x1" edc:name="PRT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT5" edc:mask="0x1" edc:name="PRT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT6" edc:mask="0x1" edc:name="PRT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRT7" edc:mask="0x1" edc:name="PRT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="TU16BPRT0" edc:mask="0x1" edc:name="TU16BPRT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRT1" edc:mask="0x1" edc:name="TU16BPRT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRT2" edc:mask="0x1" edc:name="TU16BPRT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRT3" edc:mask="0x1" edc:name="TU16BPRT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRT4" edc:mask="0x1" edc:name="TU16BPRT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRT5" edc:mask="0x1" edc:name="TU16BPRT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRT6" edc:mask="0x1" edc:name="TU16BPRT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRT7" edc:mask="0x1" edc:name="TU16BPRT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="TU16BPR24" edc:mask="0x1" edc:name="TU16BPR24" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR25" edc:mask="0x1" edc:name="TU16BPR25" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR26" edc:mask="0x1" edc:name="TU16BPR26" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR27" edc:mask="0x1" edc:name="TU16BPR27" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR28" edc:mask="0x1" edc:name="TU16BPR28" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR29" edc:mask="0x1" edc:name="TU16BPR29" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR30" edc:mask="0x1" edc:name="TU16BPR30" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR31" edc:mask="0x1" edc:name="TU16BPR31" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="TU16BCLK" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="TU16BCLK" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-03877_tmr_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xe" edc:_addr="0x3B7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:mask="0x1f" edc:name="CLK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK2" edc:mask="0x1" edc:name="CLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK3" edc:mask="0x1" edc:name="CLK3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK4" edc:mask="0x1" edc:name="CLK4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TU16BCLK0" edc:mask="0x1" edc:name="TU16BCLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BCLK1" edc:mask="0x1" edc:name="TU16BCLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BCLK2" edc:mask="0x1" edc:name="TU16BCLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BCLK3" edc:mask="0x1" edc:name="TU16BCLK3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BCLK4" edc:mask="0x1" edc:name="TU16BCLK4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
