garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q24.PIC
          <edc:SFRDef edc:access="---nnnnn" edc:cname="ADPREH" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="ADPREH" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3F2">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRE" edc:mask="0x1f" edc:name="PRE" edc:nzwidth="0x5"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PRE8" edc:mask="0x1" edc:name="PRE8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE9" edc:mask="0x1" edc:name="PRE9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE10" edc:mask="0x1" edc:name="PRE10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE11" edc:mask="0x1" edc:name="PRE11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE12" edc:mask="0x1" edc:name="PRE12" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADPRE" edc:mask="0x1f" edc:name="ADPRE" edc:nzwidth="0x5"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="ADPRE8" edc:mask="0x1" edc:name="ADPRE8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADPRE9" edc:mask="0x1" edc:name="ADPRE9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADPRE10" edc:mask="0x1" edc:name="ADPRE10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADPRE11" edc:mask="0x1" edc:name="ADPRE11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADPRE12" edc:mask="0x1" edc:name="ADPRE12" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nn-n-n-n" edc:cname="ADCON0" edc:desc="" edc:impl="0xd5" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-0-0-0" edc:name="ADCON0" edc:nzwidth="0x8" edc:por="00-0-0-0" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3F3">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GO" edc:desc="" edc:mask="0x1" edc:name="GO" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FM" edc:mask="0x1" edc:name="FM" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x1" edc:name="CS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CONT" edc:desc="" edc:mask="0x1" edc:name="CONT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADGO" edc:mask="0x1" edc:name="ADGO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADFM" edc:mask="0x1" edc:name="ADFM" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="ADCS" edc:mask="0x1" edc:name="ADCS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCONT" edc:mask="0x1" edc:name="ADCONT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADON" edc:mask="0x1" edc:name="ADON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DONE" edc:mask="0x1" edc:name="DONE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FM0" edc:mask="0x1" edc:name="FM0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="GO_nDONE" edc:mask="0x1" edc:name="GO_nDONE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADFM0" edc:mask="0x1" edc:name="ADFM0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn---nn" edc:cname="ADCON1" edc:desc="" edc:impl="0xe3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000---00" edc:name="ADCON1" edc:nzwidth="0x8" edc:por="000---00" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5a1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3F4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DSEN" edc:desc="" edc:mask="0x1" edc:name="DSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCSC" edc:mask="0x1" edc:name="PCSC" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GPOL" edc:desc="" edc:mask="0x1" edc:name="GPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IPEN" edc:desc="" edc:mask="0x1" edc:name="IPEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PPOL" edc:desc="" edc:mask="0x1" edc:name="PPOL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADDSEN" edc:desc="" edc:mask="0x1" edc:name="ADDSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPCSC" edc:mask="0x1" edc:name="ADPCSC" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADGPOL" edc:mask="0x1" edc:name="ADGPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIPEN" edc:mask="0x1" edc:name="ADIPEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADPPOL" edc:mask="0x1" edc:name="ADPPOL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
