garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F45Q24.PIC
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="IOCCF" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="IOCCF" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x417">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCCF0" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF1" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF2" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF3" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF4" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF5" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCCF6" edc:mask="0x1" edc:name="IOCCF0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x418"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WPUD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WPUD" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x419">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUD0" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD1" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD2" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD3" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD4" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD5" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD6" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUD7" edc:mask="0x1" edc:name="WPUD0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ODCOND" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ODCOND" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x41A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCD0" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD1" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD2" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD3" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD4" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD5" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD6" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCD7" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCOND" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SLRCOND" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x41B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRD0" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD1" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD2" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD3" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD4" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD5" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD6" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRD7" edc:mask="0x1" edc:name="SLRD0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="INLVLD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="INLVLD" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x41C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLD0" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD1" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD2" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD3" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD4" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD5" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD6" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLD7" edc:mask="0x1" edc:name="INLVLD0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
